# day13

In [10]:
import pandas as pd
import numpy as np

In [11]:
name = ["Carol","Kate","Jane","Kuda","Tito","Kuku"]
age = [23,np.nan,34,56,np.nan,44]

In [12]:
df = pd.DataFrame({"Name": name , "Age": age})

In [13]:
df

    Name   Age
0  Carol  23.0
1   Kate   NaN
2   Jane  34.0
3   Kuda  56.0
4   Tito   NaN
5   Kuku  44.0

In [43]:
a =df.loc[pd.isna(df["Age"]) ,"Age"]

In [45]:
a.size

2

In [46]:
df2 = df.copy()